# CustomFieldEditPropertiesService Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..CustomFieldEditPropertiesService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
Autodesk Internal: The service for editing properties of a custom field.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId CustomFieldEditPropertiesService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CustomFieldEditPropertiesService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ CustomFieldEditPropertiesService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace